Revit 2027 API
WorksharingUtils.GetCheckoutStatus Method
Overload List
Name | Description
GetCheckoutStatus(Document, ElementId) |  Gets the ownership status of an element.
GetCheckoutStatus(Document, ElementId, String) |  Gets the ownership status and outputs the owner of an element.
Top
See Also
Reference
WorksharingUtils Class
Autodesk.Revit.DB Namespace